glenn-edgar/motioncore-prototype/samd21/apps/register_dongle/main.c
    rs485_frame_t f;
    if (rs485_recv(&f)
        && (f.type & RS485_FT_MASK) == RS485_FT_DATA
        && f.src == g_bridge_slave
        && f.len >= 2u) {
        // DATA payload = [opcode:u16-LE][body]; buffer it; the block above relays
        // it to the Pi, retrying while the USB ring is momentarily full.
        g_bridge_reply      = f;
        g_bridge_have_reply = true;
    } else if ((int32_t)(board_millis() - g_bridge_deadline) >= 0) {
        // Dead/slow slave — relay OP_NAK { reason, rejected_cmd } to the Pi.
        uint8_t nak[3] = {
            (uint8_t)NAK_ERR_NO_RESOURCES,
            (uint8_t)(OP_SHELL_EXEC & 0xFFu),
            (uint8_t)(OP_SHELL_EXEC >> 8),
        };
        frame_meta_t meta = {
            .addr        = g_bridge_slave,
            .cmd         = OP_NAK,
            .seq         = g_bridge_seq++,
            .ack_seq     = 0,
            .ack_status  = 0,
            .payload_len = sizeof(nak),
        };
        (void)frame_encode_s2m(&meta, nak, &g_tx_ring);
        g_bridge_pending = false;
    }
}

// ----------------------------------------------------------------------------
// Bus-controller autonomous poll engine (BC-3 / Stage 3a-i). When the Pi has
// enabled polling (CMD_BUS_POLL_ENABLE), the BC round-robins the ENABLED roster
// at the configured cadence: send POLL(UDP) to one slave, open a bounded window
// for its reply, and update liveness. A slave that misses `max_misses` polls in
// a row is marked DEAD and OP_BUS_SLAVE_DOWN pushed to the Pi; its first good
// frame after that marks it ALIVE and pushes OP_BUS_SLAVE_UP.
//
// 3a-i: the slave's window is just NO_MESSAGE (any valid frame from it = alive).
// Slave->Pi DATA forwarding (events) is 3b; TCP ack-table + queued Pi->slave
// commands are 3c. While polling is enabled the --target bridge is refused
// (bridge_start no-ops) — the two own the bus mutually exclusively until 3c.
//
// Non-blocking state machine: one POLL per (re)entry, every wait deadline-
// guarded, so the loop can never wedge the engine. The bus-progress WDT that
// would catch a *logic* wedge (engine ticks but no bus bytes) is 3a-ii.
// ----------------------------------------------------------------------------
#define POLL_SLOT_TIMEOUT_MS 20u   // per-slave reply window (> a slave's worst RX->TX turnaround)

typedef enum { POLL_IDLE = 0, POLL_WAIT = 1 } poll_state_t;
static poll_state_t g_poll_state    = POLL_IDLE;
static uint8_t      g_poll_cursor   = 0;   // round-robin slot cursor (opaque)
static uint8_t      g_poll_cur_addr = 0;   // addr currently polled
static uint8_t      g_poll_seq      = 0;   // POLL frame seq
static uint32_t     g_poll_next_ms  = 0;   // next slot start (cadence gate)
static uint32_t     g_poll_deadline = 0;   // current window deadline

// --- Stage 3c: one command injected into the sweep (single in flight) -------
// While polling owns the bus, a Pi frame addressed to a slave is queued here and
// sent on the next slot as DATA (instead of a routine POLL). The slave's reply
// rides that same window back and is relayed to the Pi (defer-never-drop). One
// transaction in flight; Step 6 adds a real queue + scheduler + retry.
#define CMD_WINDOW_TIMEOUT_MS  BRIDGE_TIMEOUT_MS   // commands may run slow HIL; >> 20ms poll window

typedef enum { CMD_IDLE = 0, CMD_QUEUED, CMD_SENT, CMD_REPLY } cmd_state_t;
static cmd_state_t   g_cmd_state = CMD_IDLE;
static uint8_t       g_cmd_slave = 0;
static uint8_t       g_cmd_buf[RS485_PAYLOAD_MAX];   // [opcode:u16][exec body]
static uint8_t       g_cmd_len   = 0;
static rs485_frame_t g_cmd_reply;                    // buffered slave reply awaiting USB relay

// Pi -> slave command enqueue (from rx_drain while polling is enabled). Drops a
// second enqueue while one is in flight (the Pi retries; Step 6 queues properly).
static void bus_cmd_enqueue(uint8_t slave, const uint8_t* exec, uint8_t exec_len) {
    if (g_cmd_state != CMD_IDLE) return;
    if (exec_len > (uint8_t)(RS485_PAYLOAD_MAX - 2u)) exec_len = RS485_PAYLOAD_MAX - 2u;
    g_cmd_buf[0] = (uint8_t)(OP_SHELL_EXEC & 0xFFu);
    g_cmd_buf[1] = (uint8_t)(OP_SHELL_EXEC >> 8);
    for (uint8_t i = 0; i < exec_len; i++) g_cmd_buf[2u + i] = exec[i];
    g_cmd_len   = (uint8_t)(2u + exec_len);
    g_cmd_slave = slave;
    g_cmd_state = CMD_QUEUED;
}

// Relay a captured command reply to the Pi, retrying while the TX ring is full
// (defer-never-drop, same discipline as bus_drain_events). Reply DATA payload =
// [opcode:u16][body] -> s2m frame addr=slave, cmd=opcode. Called every main loop.
static void bus_drain_cmd_reply(void) {
    if (g_cmd_state != CMD_REPLY) return;
    uint16_t opcode = (uint16_t)g_cmd_reply.payload[0]
                    | ((uint16_t)g_cmd_reply.payload[1] << 8);
    frame_meta_t meta = { .addr = g_cmd_slave, .cmd = opcode, .seq = g_bridge_seq,
                          .ack_seq = 0, .ack_status = 0,
                          .payload_len = (uint8_t)(g_cmd_reply.len - 2u) };
    if (frame_encode_s2m(&meta, &g_cmd_reply.payload[2], &g_tx_ring) == 0) {
        g_bridge_seq++;
        g_cmd_state = CMD_IDLE;   // transaction complete
    }
    // else: ring full, retry next loop.
}

// Emit one pending summary-bit edge (OP_BUS_SLAVE_FLAGGED [addr][flags]) per
// call, defer-never-drop (same discipline as bus_drain_events). The roster's
// (summary != announced_summary) IS the pending-edge flag. The flags byte bit0
// = an armed interlock on that slave is tripped; L2 reads detail + advises.
static void bus_drain_flagged(void) {
    uint8_t n = bus_roster_count();
    for (uint8_t i = 0; i < n; i++) {
        const bus_slave_t* cs = bus_roster_at(i);
        if (cs == NULL || cs->summary == cs->announced_summary) continue;
        bus_slave_t* s = bus_roster_find(cs->addr);
        if (s == NULL) continue;
        uint8_t body[2] = { s->addr, s->summary };
        frame_meta_t meta = { .addr = s->addr, .cmd = OP_BUS_SLAVE_FLAGGED, .seq = g_bridge_seq,
                              .ack_seq = 0, .ack_status = 0, .payload_len = sizeof(body) };
        if (frame_encode_s2m(&meta, body, &g_tx_ring) == 0) {
            g_bridge_seq++;
            s->announced_summary = s->summary;
        }
        return;   // one emit per call; ring may be full — retry next loop
    }
}

// Slave answered: clear misses, stamp last_seen, set ALIVE. (Event push is
// handled by bus_reconcile_events so a momentarily-full TX ring can't drop it.)
static void bus_mark_alive(uint8_t addr, uint32_t now) {
    bus_slave_t* s = bus_roster_find(addr);
    if (s == NULL) return;
    s->consecutive_misses = 0;
    s->last_seen_ms       = now;
    s->state              = BUS_STATE_ALIVE;
}

