glenn-edgar/motioncore-prototype/samd21/apps/register_dongle/main.c
// Slave missed its window: bump misses; cross max_misses once -> DEAD.
static void bus_mark_miss(uint8_t addr, uint8_t max_misses) {
    bus_slave_t* s = bus_roster_find(addr);
    if (s == NULL) return;
    if (s->consecutive_misses < 0xFFu) s->consecutive_misses++;
    if (s->state != BUS_STATE_DEAD && s->consecutive_misses >= max_misses) {
        s->state = BUS_STATE_DEAD;
    }
}

// Reconcile the WHOLE roster's announced state with real state, emitting one
// pending edge event (DOWN / UP) per call. Called every main-loop iteration
// (not from the poll engine) so a momentarily-full TX ring just defers the emit
// to the next loop — the same drain discipline as the bridge reply. The roster's
// (state != announced_state) IS the pending-event flag: an event can never be
// lost, only delayed until the ring drains. One emit per call keeps each loop
// cheap; multiple pending events drain over successive loops (sub-ms apart).
// UNKNOWN->ALIVE is silent (only a recovery from DEAD pushes UP, per the spec).
static void bus_drain_events(void) {
    uint8_t n = bus_roster_count();
    for (uint8_t i = 0; i < n; i++) {
        const bus_slave_t* cs = bus_roster_at(i);
        if (cs == NULL || cs->state == cs->announced_state) continue;
        bus_slave_t* s = bus_roster_find(cs->addr);   // mutable handle
        if (s == NULL) continue;

        if (s->state == BUS_STATE_DEAD) {
            uint8_t body[1] = { s->addr };
            frame_meta_t meta = { .addr = s->addr, .cmd = OP_BUS_SLAVE_DOWN, .seq = g_bridge_seq,
                                  .ack_seq = 0, .ack_status = 0, .payload_len = sizeof(body) };
            if (frame_encode_s2m(&meta, body, &g_tx_ring) == 0) {
                g_bridge_seq++;
                s->announced_state = BUS_STATE_DEAD;
            }
            return;   // one emit per call; ring may be full — retry next loop
        } else if (s->state == BUS_STATE_ALIVE) {
            if (s->announced_state == BUS_STATE_DEAD) {
                uint8_t body[5];
                body[0] = s->addr;
                body[1] = (uint8_t)(s->class_id      );
                body[2] = (uint8_t)(s->class_id >>  8);
                body[3] = (uint8_t)(s->class_id >> 16);
                body[4] = (uint8_t)(s->class_id >> 24);
                frame_meta_t meta = { .addr = s->addr, .cmd = OP_BUS_SLAVE_UP, .seq = g_bridge_seq,
                                      .ack_seq = 0, .ack_status = 0, .payload_len = sizeof(body) };
                if (frame_encode_s2m(&meta, body, &g_tx_ring) == 0) {
                    g_bridge_seq++;
                    s->announced_state = BUS_STATE_ALIVE;
                }
                return;   // one emit per call
            } else {
                s->announced_state = BUS_STATE_ALIVE;   // UNKNOWN->ALIVE: no event, no frame
            }
        }
    }
}

static void bus_poll_engine(void) {
    bus_poll_cfg_t* cfg = bus_poll_cfg();
    if (!cfg->enabled) { g_poll_state = POLL_IDLE; return; }
    uint32_t now = board_millis();

    if (g_poll_state == POLL_IDLE) {
        if ((int32_t)(now - g_poll_next_ms) < 0) return;     // hold cadence
        rs485_rx_flush();                                    // drop stale before listening
        if (g_cmd_state == CMD_QUEUED) {
            // Inject the queued command into this slot instead of a routine POLL.
            // Its reply (a DATA frame) is captured in POLL_WAIT and relayed.
            g_poll_cur_addr = g_cmd_slave;
            rs485_send(g_cmd_slave, BUS_CONTROLLER_LOCAL_ADDR, RS485_FT_DATA,
                       ++g_poll_seq, g_cmd_buf, g_cmd_len);
            g_cmd_state     = CMD_SENT;
            g_poll_deadline = now + CMD_WINDOW_TIMEOUT_MS;
            g_poll_state    = POLL_WAIT;
            return;
        }
        const bus_slave_t* s = bus_roster_next_enabled(&g_poll_cursor);
        if (s == NULL) { g_poll_next_ms = now + cfg->poll_period_ms; return; }
        g_poll_cur_addr = s->addr;
        rs485_send(s->addr, BUS_CONTROLLER_LOCAL_ADDR, RS485_FT_POLL, ++g_poll_seq, NULL, 0);
        g_poll_deadline = now + POLL_SLOT_TIMEOUT_MS;
        g_poll_state    = POLL_WAIT;
        return;
    }

    // POLL_WAIT: any valid frame from the polled slave = alive; else timeout = miss.
    // For a command slot (CMD_SENT) the slave's DATA reply is buffered for relay;
    // bus_drain_cmd_reply() (main loop) forwards it defer-never-drop. POLL_WAIT
    // only updates roster state; bus_drain_events() emits the DOWN/UP edge.
    rs485_frame_t f;
    if (rs485_recv(&f) && f.src == g_poll_cur_addr) {
        bus_mark_alive(g_poll_cur_addr, now);
        if (g_cmd_state == CMD_SENT) {
            if ((f.type & RS485_FT_MASK) == RS485_FT_DATA && f.len >= 2u) {
                g_cmd_reply = f;
                g_cmd_state = CMD_REPLY;        // hand off to bus_drain_cmd_reply()
            } else {
                g_cmd_state = CMD_IDLE;         // non-DATA answer: nothing to relay
            }
        } else {
            // Routine poll reply (NO_MESSAGE [summary]): capture the summary-bit.
            // bus_drain_flagged() emits the edge so a full ring defers, not drops.
            bus_slave_t* s = bus_roster_find(g_poll_cur_addr);
            if (s != NULL) s->summary = (f.len >= 1u) ? f.payload[0] : 0u;
        }
        g_poll_state   = POLL_IDLE;
        g_poll_next_ms = now + cfg->poll_period_ms;
    } else if ((int32_t)(now - g_poll_deadline) >= 0) {
        bus_mark_miss(g_poll_cur_addr, cfg->max_misses);
        if (g_cmd_state == CMD_SENT) g_cmd_state = CMD_IDLE;   // give up; Pi demux times out
        g_poll_state   = POLL_IDLE;
        g_poll_next_ms = now + cfg->poll_period_ms;
    }
}
#endif  // ROLE_BUS_CONTROLLER

#if defined(ROLE_SLAVE)
// ----------------------------------------------------------------------------
// RS-485 slave, ISR-driven response (Layer-1 / 4b-i). The RX-complete ISR
// assembles each frame addressed to us and dispatches it via slave_rx_isr (IN
// ISR CONTEXT):
//   * POLL -> answer immediately with NO_MESSAGE carrying the PRIMED interlock
//             summary byte (bit0 = an armed interlock tripped). Served straight
//             from the interrupt, zero main-loop involvement.
//   * DATA -> stash into the one-in-flight input buffer for the main loop.
// The main loop (rs485_slave_poll) keeps the summary primed, then processes a
// stashed DATA (an OP_SHELL_EXEC body) through the SAME shell layer used over USB
// and queues the OP_SHELL_REPLY via the non-blocking TX engine. Replies >
// RS485_PAYLOAD_MAX-2 are clamped (fragmentation is later).
//
// NOTE (4b-ii boundary): today the BC waits for the command reply inside its poll
// window, so the slave sends it from the main loop here. When the BC sweep moves
// into its own ISR, the reply becomes a second "fresh" buffer the slave ISR emits
// on a poll alongside the interlock buffer (the full two-buffer model).
// ----------------------------------------------------------------------------
#define RS485_SHELL_EXEC_HEADER_LEN 4u   // request_id u16 + command_id u16

static volatile uint8_t g_slave_summary;       // primed interlock summary (ISR reads)
static volatile bool    g_slave_in_fresh;      // a DATA frame awaits the main loop
static rs485_frame_t    g_slave_in;            // ISR -> main loop (owned while fresh)

