glenn-edgar/motioncore-prototype/samd21/apps/register_dongle/main.c
static uint8_t g_slave_reply[RS485_PAYLOAD_MAX];  // pending reply ([opcode][body])
static uint8_t g_slave_reply_len;
static uint8_t g_slave_reply_seq;
static bool    g_slave_reply_pending;

// ISR context: answer POLL from the interrupt; defer DATA to the main loop.
static void slave_rx_isr(const rs485_frame_t* f) {
    uint8_t cls = (uint8_t)(f->type & RS485_FT_MASK);
    if (cls == RS485_FT_POLL) {
        // Primed summary is a single byte -> atomic read; frame built in-call.
        rs485_tx_async_start(RS485_ADDR_MASTER, register_dongle_rs485_addr(),
                             RS485_FT_NO_MESSAGE, f->seq,
                             (const uint8_t*)&g_slave_summary, 1);
        // If TX is busy this round, the BC simply re-polls — best-effort.
    } else if (cls == RS485_FT_DATA) {
        if (!g_slave_in_fresh) {       // one in flight; else drop (BC retries)
            g_slave_in = *f;
            g_slave_in_fresh = true;
        }
    }
}

static void rs485_slave_poll(void) {
    // Keep the ISR's POLL-response summary current (1 byte = atomic on M0+).
    g_slave_summary = interlock_summary_flags();

    // Retry a reply the TX engine couldn't take last time (defer-never-drop).
    if (g_slave_reply_pending) {
        if (rs485_tx_async_start(RS485_ADDR_MASTER, register_dongle_rs485_addr(),
                                 RS485_FT_DATA, g_slave_reply_seq,
                                 g_slave_reply, g_slave_reply_len))
            g_slave_reply_pending = false;
        return;
    }

    if (!g_slave_in_fresh) return;
    rs485_frame_t f = g_slave_in;      // own the buffer while fresh...
    g_slave_in_fresh = false;          // ...then release it to the ISR

    if ((f.type & RS485_FT_MASK) != RS485_FT_DATA || f.len < 2u) return;
    uint16_t opcode = (uint16_t)f.payload[0] | ((uint16_t)f.payload[1] << 8);
    if (opcode != OP_SHELL_EXEC) return;
    const uint8_t* exec     = &f.payload[2];
    uint16_t       exec_len = (uint16_t)(f.len - 2u);
    if (exec_len < RS485_SHELL_EXEC_HEADER_LEN) return;

    uint8_t  reply_body[COMM_PAYLOAD_MAX];
    uint16_t reply_len = shell_dispatch_payload(exec, exec_len, reply_body);
    if (reply_len > (uint16_t)(RS485_PAYLOAD_MAX - 2u)) reply_len = RS485_PAYLOAD_MAX - 2u;
    g_slave_reply[0] = (uint8_t)(OP_SHELL_REPLY & 0xFFu);
    g_slave_reply[1] = (uint8_t)(OP_SHELL_REPLY >> 8);
    for (uint16_t i = 0; i < reply_len; i++) g_slave_reply[2u + i] = reply_body[i];
    g_slave_reply_len = (uint8_t)(2u + reply_len);
    g_slave_reply_seq = f.seq;
    g_slave_reply_pending = true;
    if (rs485_tx_async_start(RS485_ADDR_MASTER, register_dongle_rs485_addr(),
                             RS485_FT_DATA, g_slave_reply_seq,
                             g_slave_reply, g_slave_reply_len))
        g_slave_reply_pending = false;
}
#endif

static void rx_drain_to_event_queue(s_expr_tree_instance_t* tree) {
    if (!tud_cdc_connected() || !tud_cdc_available()) return;
    uint32_t n = tud_cdc_read(g_rx_buf, sizeof(g_rx_buf));
    for (uint32_t i = 0; i < n; i++) {
        frame_meta_t meta;
        frame_decode_result_t r =
            frame_decoder_feed(&g_rx_decoder, g_rx_buf[i], &meta, g_rx_payload);
        if (r == FRAME_DECODE_FRAME_READY) {
            // Slice 6 — feed the IL_VIRT_T_SINCE_M2S virtual.
            g_last_m2s_rx_ms = board_millis();
#if defined(ROLE_BUS_CONTROLLER)
            // Address routing: a frame for any addr other than ours is destined
            // for an RS-485 slave. While the sweep owns the bus, inject it into a
            // poll slot (Stage 3c); otherwise use the reactive one-shot bridge.
            if (meta.addr != BUS_CONTROLLER_LOCAL_ADDR) {
                if (bus_poll_cfg()->enabled)
                    bus_cmd_enqueue(meta.addr, g_rx_payload, meta.payload_len);
                else
                    bridge_start(meta.addr, g_rx_payload, meta.payload_len);
                continue;
            }
#endif
            // OP_COMMISSION_SET carries a u32 new_instance_id. Stage it into
            // a single-producer/single-consumer global so the chain handler
            // can read it; libcomm's one-in-flight rule keeps this race-free.
            if (meta.cmd == OP_COMMISSION_SET && meta.payload_len >= 4) {
                g_pending_commission_instance_id =
                    (uint32_t)g_rx_payload[0] |
                    ((uint32_t)g_rx_payload[1] <<  8) |
                    ((uint32_t)g_rx_payload[2] << 16) |
                    ((uint32_t)g_rx_payload[3] << 24);
            }
            // OP_POLL: inline-handled (skips chain); replies with status buffer.
            if (meta.cmd == OP_POLL) {
                handle_op_poll_inline();
                continue;
            }
            // OP_SHELL_EXEC carries a variable-length binary message that
            // outlives a single rx_drain pass. Queue it; only push the engine
            // event if the queue accepted it, otherwise the handler would
            // replay an older payload (was the request_id-cluster bug).
            if (meta.cmd == OP_SHELL_EXEC) {
                if (meta.payload_len <= COMM_PAYLOAD_MAX
                    && shell_pending_push(g_rx_payload, meta.payload_len)) {
                    s_expr_event_push(tree, SE_EVENT_TICK, meta.cmd, NULL);
                }
                // else: queue full or oversize — drop. Host's request times out.
            } else {
                // All non-shell opcodes: just push (event_data NULL).
                s_expr_event_push(tree, SE_EVENT_TICK, meta.cmd, NULL);
            }
        }
        // BAD_CRC / BAD_LEN / OVERFLOW: decoder auto-resets; nothing to do
        // here — a host-side retry will re-sync on the next leading END.
    }
}

// ----------------------------------------------------------------------------
// Entry
// ----------------------------------------------------------------------------

int main(void) {
    // Snapshot PM->RCAUSE BEFORE anything else can clobber it. Distinguishes
    // WDT bite (the layer-2 chain-stuck signal) from power-on / external
    // reset / NVIC_SystemReset.
    hal_capture_reset_cause();

    // Paint stack + install canary. Must run AFTER reset cause capture
    // (which uses minimal stack) and BEFORE any deeper call chain that
    // would consume more stack than our 64 B paint-safety margin allows.
    stack_paint_and_canary();

    // Interlock framework boot decision. Reads .noinit persistence, applies
    // bootloop guard, marks slots POISONED if they've crashed too many times
    // in a row. Must run before board_init / engine setup so the framework
    // can also report attribution if the very next thing crashes.
    interlock_boot_decide();

    board_init();

    // Arm the WDT immediately after board_init so any subsequent hang in
    // tusb_init / engine bring-up triggers recovery within ~4 s. The pet
    // site lives in the s_engine chain pump (s_expr_node_tick).
    hal_wdt_init();

    // Bring up always-on peripherals (DAC, ADC, and future I2C/RS-485) once,
    // pre-engine. Pins they own are reserved from GPIO commands by
    // pin_is_reserved() in samd21_commands.c.
    samd21_peripherals_init();

    // Re-parse + re-claim pins for any DSL-defined interlock slots that
    // survived the warm boot. Slots that fail re-parse / re-claim are
    // marked POISONED. Idempotent on cold boot (no ARMED slots).
    interlock_warm_restore();

    tusb_rhport_init_t const rhport_init = {
        .role  = TUSB_ROLE_DEVICE,
        .speed = TUSB_SPEED_AUTO,
    };
    tusb_init(BOARD_TUD_RHPORT, &rhport_init);

