glenn-edgar/motioncore-prototype/samd21/apps/register_dongle/main.c
    frame_ring_init(&g_tx_ring, g_tx_ring_buf, TX_RING_SIZE);
    frame_decoder_init(&g_rx_decoder, FRAME_DIR_M2S);

    // Slice 6: seed the m2s timestamp at "now" so _t_since_m2s starts at 0,
    // not at uptime. Host hasn't sent anything yet but we don't want the
    // virtual to trip an arming-immediately watch before the first frame.
    g_last_m2s_rx_ms = board_millis();

    // L0: read commissioning blob from flash before engine starts.
    // Factory-fresh dongles read nothing; defaults to UNCOMMISSIONED.
    register_dongle_load_commissioning();

    // RS-485 transport config. flags=0 (no self-echo discard) is correct on BOTH
    // bare-TTL cross-wire AND a shared transceiver bus: address/src filtering
    // already rejects a node's own echo, and the ISR + 256-word ring absorb it.
    // RS485_FLAG_SHARED_BUS is an optional cleanliness optimisation for the
    // shared bus; enable it at runtime via CMD_RS485_CONFIG once transceivers are
    // in. It MUST stay off for a D6->D7 loopback self-test (echo IS the signal).
#if defined(ROLE_SLAVE)
    // Slave listens only for frames addressed to its rs485_addr (= low byte of
    // instance_id). Must run after commissioning is loaded. 0 if uncommissioned.
    rs485_config(0, register_dongle_rs485_addr(), 0);
    // Layer-1 / 4b-i: answer POLLs straight from the RX-complete ISR; DATA is
    // deferred to the main loop via the one-in-flight input buffer.
    rs485_set_isr_dispatch(slave_rx_isr);
#elif defined(ROLE_BUS_CONTROLLER)
    // Master stays a sniffer (accept every slave reply).
    rs485_config(0, RS485_ADDR_SNIFFER, 0);
#endif

    s_expr_allocator_t alloc = {
        .malloc      = bump_malloc,
        .free        = bump_free,
        .ctx         = NULL,
        .get_time    = NULL,    // skip double-precision path; see comment below
        .get_time_ms = engine_get_time_ms,
    };

    s_expr_module_t module;
    s_expr_tree_instance_t* tree = NULL;
    uint8_t init_err = s_engine_init_rom(&module, &register_dongle_v2_module_rom, alloc);
    (void)init_err;
    if (init_err == S_EXPR_ERR_OK) {
        s_expr_module_set_debug(&module, debug_packet_fn);
        tree = s_expr_tree_create_by_hash(&module, REGISTER_DONGLE_V2_HASH, 0);

        // Emit captured reset cause as first dbg_log frame. Sits in TX ring
        // until USB CDC enumerates; host sees on first attach. Grep-able
        // literal "[BOOT] rstsr=0xNN" — only RCAUSE low byte is meaningful.
        char buf[24];
        uint8_t rc = hal_get_reset_cause();
        static const char hex[] = "0123456789abcdef";
        buf[0]='['; buf[1]='B'; buf[2]='O'; buf[3]='O'; buf[4]='T'; buf[5]=']';
        buf[6]=' '; buf[7]='r'; buf[8]='s'; buf[9]='t'; buf[10]='s'; buf[11]='r';
        buf[12]='='; buf[13]='0'; buf[14]='x';
        buf[15] = hex[(rc >> 4) & 0xF];
        buf[16] = hex[(rc >> 0) & 0xF];
        buf[17] = '\0';
        debug_packet_fn(NULL, buf);

        // Companion line summarising interlock persistence + crash record.
        // Always emitted, even on cold boot (slots EMPTY, crash zeroed).
        char il_buf[96];
        (void)interlock_format_boot_line(il_buf, sizeof(il_buf));
        debug_packet_fn(NULL, il_buf);
    }

    // Engine tick cadence: 50 ms (20 ticks/sec) for snappy command latency — a
    // shell-exec event waits at most one tick before the chain dispatches it.
    // The chain's only tick-counted timers (heartbeat, BOOT REGISTER retry) are
    // rate-limited to wall-clock in their handlers, so they don't scale with the
    // faster tick. Interlock eval is decoupled onto its own 1 ms gate below.
    uint32_t next_tick_ms = 25;
    uint32_t next_il_ms   = 1;

    // Host-reattach detection: poll tud_cdc_connected() (DTR line state).
    // On false->true edge after a prior true->false drop, push
    // EV_HOST_REATTACH to the engine event queue. The chain's
    // handle_internal_events user fn responds by writing dongle_state =
    // BOOT, which se_state_machine sees on its tick within the same drain.
    // Polling (not the tud_cdc_line_state_cb callback) keeps it
    // race-free single-producer for the event queue.
    bool prev_cdc_connected = false;
    bool saw_disconnect     = false;

    // Defensive amendment D — gate entry to the main loop on invariants.
    // Any failure panics with a discriminated code; next boot prints it.
    system_self_check();

    for (;;) {
        tud_task();

        // Host-reattach edge detection.
        if (tree != NULL) {
            bool now_connected = tud_cdc_connected();
            if (!now_connected && prev_cdc_connected) {
                saw_disconnect = true;
                // DIAG: log the drop event so we can see DTR transitions.
                if (module.debug_fn) module.debug_fn(NULL, "[CDC] DTR dropped");
            } else if (now_connected && !prev_cdc_connected) {
                if (saw_disconnect) {
                    saw_disconnect = false;
                    s_expr_event_push(tree, SE_EVENT_TICK, EV_HOST_REATTACH, NULL);
                    if (module.debug_fn) module.debug_fn(NULL, "[CDC] DTR up after drop -> EV_HOST_REATTACH");
                } else {
                    if (module.debug_fn) module.debug_fn(NULL, "[CDC] DTR up (first attach)");
                }
            }
            prev_cdc_connected = now_connected;
        }

        // Always drain RX, even between ticks — events accumulate in the
        // tree's queue and are dispatched at the next tick_and_drain().
        if (tree != NULL) {
            rx_drain_to_event_queue(tree);
        }

        // RS-485 service, by role: slave answers tunneled shell-exec frames;
        // bus_controller relays the in-flight bridge reply; dongle sniffs frames
        // up to the host (passthrough diagnostics).
#if defined(ROLE_SLAVE)
        rs485_slave_poll();
#elif defined(ROLE_BUS_CONTROLLER)
        // Polling enabled -> autonomous master owns the bus; else the reactive
        // --target bridge stays available for bench HIL on a single slave.
        if (bus_poll_cfg()->enabled) {
            bus_poll_engine();
            bus_drain_events();      // emit pending DOWN/UP; full ring defers, never drops
            bus_drain_flagged();     // emit pending summary-bit edges (interlock tripped)
            bus_drain_cmd_reply();   // relay a captured command reply; same discipline
        } else {
            rs485_bridge_poll();
        }
#else
        rs485_drain_to_host();
#endif

        uint32_t now = board_millis();

