glenn-edgar/motioncore-prototype/samd21/apps/register_dongle/main.c
        // Interlock eval on a fast ~1 kHz cadence, decoupled from the slow chain
        // tick — a bounded safety response instead of the chain's command
        // cadence. Single-core: this runs sequentially with the chain pump, so a
        // CMD_INTERLOCK_SET dispatched on a chain tick can't race the eval (no
        // partial-config read; the SET completes fully before the next eval).
        if (tree != NULL && (int32_t)(now - next_il_ms) >= 0) {
            next_il_ms += 1;
            interlock_tick_all();
        }

        if (tree != NULL && (int32_t)(now - next_tick_ms) >= 0) {
            next_tick_ms += 25;
            tick_and_drain(tree);

            // Amendment A — pre-overflow SP check. Catches a near-overflow
            // BEFORE any deeper call chain can write below _sstack. 256 B
            // margin sized to cover the deepest IRQ chain (~500 B for
            // TinyUSB CDC) with half the margin reserved for IRQ overhead
            // between this check and the overflow point.
            {
                uint32_t sp;
                __asm__ volatile ("mov %0, sp" : "=r"(sp));
                if (sp < ((uintptr_t)_sstack + 256u)) {
                    panic(PANIC_STACK_NEAR_OVERFLOW, sp);
                }
            }

            // Stack hardening: verify canary + update HWM after every
            // chain pump cycle. Canary trip → panic (immediate reset) so
            // the post-mortem code surfaces in the next boot's [BOOT_IL]
            // line via panic_code = INIT_CANARY_BAD or equivalent.
            if (*(volatile uint32_t*)(uintptr_t)_sstack != STACK_CANARY_VALUE) {
                g_stack_canary_tripped = 1;
                if (module.debug_fn) {
                    module.debug_fn(NULL, "[STACK_CANARY_TRIPPED] panicking");
                }
                panic(PANIC_INIT_CANARY_BAD, 0);
            } else {
                uint32_t* p   = (uint32_t*)((uintptr_t)_sstack + 4);
                uint32_t* end = (uint32_t*)(uintptr_t)_estack;
                while (p < end && *p == STACK_PAINT_VALUE) p++;
                uint16_t used = (uint16_t)((uintptr_t)end - (uintptr_t)p);
                if (used > g_stack_hwm_bytes) g_stack_hwm_bytes = used;
            }
        }

        // Drain the TX ring to CDC every loop, but ONLY as many bytes as the CDC
        // FIFO will accept this instant. Draining a fixed 64 B and ignoring
        // tud_cdc_write()'s return silently drops the overflow (the bytes are
        // already gone from g_tx_ring) — which shreds a large frame that spans a
        // partly-full FIFO while small frames fit. Pulling exactly write_available
        // bytes keeps every frame intact; the rest stays queued for next loop.
        if (tud_cdc_connected()) {
            uint32_t avail = tud_cdc_write_available();
            if (avail > 0) {
                uint8_t buf[64];
                if (avail > sizeof(buf)) avail = sizeof(buf);
                uint32_t n = frame_ring_read_drain(&g_tx_ring, buf, avail);
                if (n > 0) {
                    tud_cdc_write(buf, n);   // n <= avail, fully accepted
                    tud_cdc_write_flush();
                }
            }
        }

        // Deferred reboot for L0 commissioning. Wait until the requested time
        // has passed AND the TX ring is empty so the OP_COMMISSION_REPLY frame
        // (and any logs) actually leave the dongle before USB renegotiates.
        if (g_reboot_at_ms != 0 && (int32_t)(board_millis() - g_reboot_at_ms) >= 0) {
            tud_cdc_write_flush();
            NVIC_SystemReset();
            // not reached
        }
    }
}
